{"$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#", "contentVersion": "1.0.0.0", "parameters": {"workspace": {"type": "String"}}, "resources": [{"id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7f6f8c3f-0a6c-4d13-91b2-ps-iwr-cmd')]", "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7f6f8c3f-0a6c-4d13-91b2-ps-iwr-cmd')]", "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules", "apiVersion": "2021-03-01-preview", "kind": "Scheduled", "properties": {"displayName": "PowerShell Download Via CMD (Invoke-WebRequest) by YourName", "description": "Detects cmd.exe spawning powershell.exe that performs a file download using Invoke-WebRequest (or aliases). Technique: .", "severity": "high", "enabled": true, "query": "SecurityEvent | where (EventID == 4688 and NewProcessName endswith @'\\\\\\\\powershell.exe' and ParentProcessName endswith @'\\\\\\\\cmd.exe' and (CommandLine contains 'Invoke-WebRequest' or CommandLine contains 'iwr' or CommandLine contains 'wget ' or CommandLine contains 'curl ' or CommandLine contains 'System.Net.WebClient' or CommandLine contains 'DownloadFile(' or CommandLine contains 'Start-BitsTransfer'))", "queryFrequency": "PT30M", "queryPeriod": "PT30M", "triggerOperator": "GreaterThan", "triggerThreshold": 0, "suppressionDuration": "PT2H30M", "suppressionEnabled": true, "tactics": [], "incidentConfiguration": {"createIncident": true, "groupingConfiguration": {"enabled": false, "reopenClosedIncident": false, "lookbackDuration": "PT2H30M", "matchingMethod": "AllEntities", "groupByEntities": [], "groupByAlertDetails": [], "groupByCustomDetails": []}}, "eventGroupingSettings": {"aggregationKind": "SingleAlert"}, "alertDetailsOverride": null, "customDetails": null, "templateVersion": "1.0.0"}}]}
